// clang-format off
typedef unsigned long Q_t;
typedef struct s_t {
  union {
    Q_t Q;
    void *v;
    void (*c)();
  };
} s_t;
#include <stdio.h>
#define N(name) void name(s_t *ο, Q_t α, Q_t ρ,  \
                          s_t *ο₂, Q_t α₂, Q_t ρ₂,  \
                          s_t *ο₃, Q_t α₃, Q_t ρ₃,  \
                          s_t *ο₄, Q_t α₄, Q_t ρ₄)
// ψ α β ε
N(Cε) {
  Q_t ψd = ο[ρ++].Q, εc = ψd >> 6 & 7, βc = ψd >> 3 & 7, αc = ψd & 7;
  for (Q_t i = 0; i < εc; i++) ο[α++].v = ο[ρ++].v;
  ρ += βc + αc;
  if(εc) α--, ο[α].c(ο, α, ρ, ο₂, α₂, ρ₂, ο₃, α₃, ρ₃, ο₄, α₄, ρ₄);
  else            Cε(ο, α, ρ, ο₂, α₂, ρ₂, ο₃, α₃, ρ₃, ο₄, α₄, ρ₄);
}
N(Cβ) {
  Q_t ψd = ο[ρ++].Q, εc = ψd >> 6 & 7, βc = ψd >> 3 & 7, αc = ψd & 7;
  ρ += εc;
  for (Q_t i = 0; i < βc; i++) ο[α++].v = ο[ρ++].v;
  ρ += αc;
  if(εc) α--, ο[α].c(ο, α, ρ, ο₂, α₂, ρ₂, ο₃, α₃, ρ₃, ο₄, α₄, ρ₄);
  else            Cβ(ο, α, ρ, ο₂, α₂, ρ₂, ο₃, α₃, ρ₃, ο₄, α₄, ρ₄);
}
N(Cα) {
  Q_t ψd = ο[ρ++].Q, εc = ψd >> 6 & 7, βc = ψd >> 3 & 7, αc = ψd & 7;
  ρ += εc + βc;
  for (Q_t i = 0; i < αc; i++) ο[α++].v = ο[ρ++].v;
  if(εc) α--, ο[α].c(ο, α, ρ, ο₂, α₂, ρ₂, ο₃, α₃, ρ₃, ο₄, α₄, ρ₄);
  else            Cα(ο, α, ρ, ο₂, α₂, ρ₂, ο₃, α₃, ρ₃, ο₄, α₄, ρ₄);
}
N(ψ) {
  Q_t ψd = ο[--α].Q, εc = ψd >> 6 & 7, βc = ψd >> 3 & 7, αc = ψd & 7;
  for (Q_t i = 0; i < εc+βc+αc; i++) ο[--ρ].v = ο[--α].v;
  ο[--ρ].Q = ψd;
  α--, ο[α].c(ο, α, ρ, ο₂, α₂, ρ₂, ο₃, α₃, ρ₃, ο₄, α₄, ρ₄);
}
#define BT {  s_t *οο;Q_t αα,ρρ;  \
              οο=ο, αα=α, ρρ=ρ;   \
              ο =ο₄,α =α₄,ρ =ρ₄;  \
              ο₄=ο₃,α₄=α₃,ρ₄=ρ₃;  \
              ο₃=ο₂,α₃=α₂,ρ₃=ρ₂;  \
              ο₂=οο,α₂=αα,ρ₂=ρρ;  }
int main() {
  s_t *ο; Q_t α,  ρ;
  s_t *ο₂;Q_t α₂, ρ₂;
  s_t *ο₃;Q_t α₃, ρ₃;
  s_t *ο₄;Q_t α₄, ρ₄;
     ο = (s_t[512]){}, α = 0, ρ = 512, ο[α++].c = Cβ;
  BT ο = (s_t[512]){}, α = 0, ρ = 512, ο[α++].c = Cβ;
  BT ο = (s_t[512]){}, α = 0, ρ = 512, ο[α++].c = Cβ;
  BT ο = (s_t[512]){}, α = 0, ρ = 512, ο[α++].c = Cβ;
  return 7;
}
