#include "oars_logn.h"
N(Cε) {
  Q_t ψd = ο[σ][ρ[σ]++].Q, εc = ψd >> 6 & 7, βc = ψd >> 3 & 7, αc = ψd & 7;
  for (Q_t i = 0; i < εc; i++) ο[σ][α[σ]++].v = ο[σ][ρ[σ]++].v;
  ρ[σ] += βc + αc;
  if(εc) O;
  else   Cε(ο,α,ρ,σ);
}
N(Cβ) {
  Q_t ψd = ο[σ][ρ[σ]++].Q, εc = ψd >> 6 & 7, βc = ψd >> 3 & 7, αc = ψd & 7;
  ρ[σ] += εc;
  for (Q_t i = 0; i < βc; i++) ο[σ][α[σ]++].v = ο[σ][ρ[σ]++].v;
  ρ[σ] += αc;
  if(βc) O;
  else   Cβ(ο,α,ρ,σ);
}
N(Cα) {
  Q_t ψd = ο[σ][ρ[σ]++].Q, εc = ψd >> 6 & 7, βc = ψd >> 3 & 7, αc = ψd & 7;
  ρ[σ] += εc + βc;
  for (Q_t i = 0; i < αc; i++) ο[σ][α[σ]++].v = ο[σ][ρ[σ]++].v;
  if(αc) O;
  else   Cα(ο,α,ρ,σ);
}
N(ψ) {
  Q_t ψd = ο[σ][--α[σ]].Q, εc = ψd >> 6 & 7, βc = ψd >> 3 & 7, αc = ψd & 7;
  for (Q_t i = 0; i < εc+βc+αc; i++) ο[σ][--ρ[σ]].v = ο[σ][--α[σ]].v;
  ο[σ][--ρ[σ]].Q = ψd;
  O;
}
